{
  "1": {
    "id": 1,
    "title": "Badges & petit déjeuner",
    "description": "Venez récupérer votre badge et manger des chocolatines avec un bon café en discutant avec vos pairs",
    "track": {
      "title": "Grand Hall"
    }
  },
  "2": {
    "id": 2,
    "title": "Keynote d'ouverture : Évolution du métier de développeur ces dernières années.",
    "description": "Lancement officiel de la conférence. Remerciements des organisateurs, des sponsors et partenaires.",
    "language": "Français",
    "complexity": "",
    "presentation": "",
    "videoId": ""
  },
  "3": {
    "id": 3,
    "title": "Pause réveil",
    "description": "Plein de caféine pour vous réveiller",
    "track": {
      "title": "Grand Hall"
    }
  },
  "4": {
    "id": 4,
    "title": "A table !",
    "description": "Un bon gros repas",
    "track": {
      "title": "Grand Hall"
    }
  },
  "5": {
    "id": 5,
    "title": "Pause café",
    "description": "Avec même du thé pour les irréductibles",
    "track": {
      "title": "Grand Hall"
    }
  },
  "6": {
    "id": 6,
    "title": "Afterparty & Networking",
    "description": "Venez avec nous débrieffer votre journée et boire un coup pour fêter ça.<br/><br/><b>Le lieu</b>: Taverne Heidelberg, [1 avenue du Général Compans 31700 BLAGNAC](http://www.taverneheidelberg.fr/)<br/><br/>Le DevFest vous offre à boire dans la limite des stocks prévus.<br/><br/>N'oubliez pas votre badge.",
    "track": {
      "title": "Taverne Heidelberg"
    }
  },
  "7": {
    "id": 7,
    "title": "Cloture du DevFest Toulouse 2016",
    "description": "Remerciements et informations pour l'afterwork",
    "track": {
      "title": "Amphi 1"
    }
  },
  "1001": {
    "id": 1001,
    "title": "Pas encore annoncé",
    "description": "Une fois les résultats du CFP publics",
    "tags": [
      "Mobile"
    ]
  },
  "1002": {
    "id": 1002,
    "title": "Pas encore annoncé",
    "description": "Une fois les résultats du CFP publics",
    "tags": [
      "Web"
    ]
  },
  "1003": {
    "id": 1003,
    "title": "Pas encore annoncé",
    "description": "Une fois les résultats du CFP publics",
    "tags": [
      "Méthodes et Outils"
    ]
  },
  "101": {
    "id": 101,
    "title": "De Angular à React (ou pas)",
    "language": "Français",
    "description": "Tech Lead d'une équipe de 6 dévelopeurs front en `AngularJS` pendant un an, j'ai acquis une bonne expertise de Angular 1.<br>Mais sur mon prochain projet, en solo, j'ai décidé d'utiliser `React`.<br>Parce qu'Angular2 n'a pas grand chose à voir avec le 1, a été mal annoncé et ne semble pas encore mûr. Parce que j'ai eu des échos favorables sur React. Parce que c'est hype et que j'aime bien ce que j'en ai vu. Mais surtout parce que je ne connais pas, et que j'aime apprendre.<br>Le projet est modérément complexe, mais utilisé par 5000 nouvelles personnes chaque jour, il doit être totalement fiable. Le client est à 4 heures de Toulouse, et pour éviter les interventions sur place, je compte blinder les tests.<br>Dans cette présentation, je ferai donc un retour d'expérience et comparerai les deux frameworks. Avantages et inconvénients de  chacun, difficultés et bonnes surprises pour qui souhaite passer de l'un à l'autre.<br>Je commence le  développement à la rentrée et espère terminer fin octobre. On pourra alors savoir si je suis resté en React, et qui sait, tester l'application grandeur nature lors de ma présentation ?",
    "speakers": [1],
    "complexity": "Confirmé",
    "tags": [
      "Web"
    ]    
  },
  "102": {
    "id": 102,
    "title": "Android et programmation réactive - RxJava",
    "language": "Français",
    "description": "Comment et pourquoi utiliser la programmation réactive <a href=\"https://github.com/ReactiveX/RxJava\">RxJava</a> en développant pour Android ?",
    "speakers": [2],
    "complexity": "Confirmé",
    "tags": [
      "Mobile"
    ]    
  },
  "103": {
    "id": 103,
    "title": "Cloud Analytics : de 0 à 100000 Evénements par seconde en 50'",
    "language": "Français",
    "description": "En partant de zéro nous aurons au bout de 50' une chaine complète d'analyse de la donnée qui verra transiter 100000 événements par seconde : de l'injection (qui est semble simple mais n'est pas trivial) jusqu'à l'outil de reporting qui montrera un report temps réel sur les données injectées.<br>En apportant puissance, flexibilité et coût faible, le cloud s'impose de plus en plus comme l'outil indispensable pour construire une chaine d'analyse de la donnée. Nous l'utiliserons durant cette session qui contiendra trucs et astuces, retours d'expérience et live coding.<br>Tags : #BigQuery #Dataflow #PubSub #DataStudio #Datalab #ComputeEngine",
    "speakers": [3],
    "complexity": "Confirmé",
    "tags": [
      "Web"
    ]    
  },
  "104": {
    "id": 104,
    "title": "Tensorflow et l’apprentissage profond, sans les équations différentielles",
    "language": "Français",
    "description": "Google a récemment publié son framework d’intelligence artificielle appelé Tensorflow. Avec ce nouvel outil, l’apprentissage automatique franchit le pas entre la science de laboratoire et le métier d’ingénieur. Dans cette session, nos vous monterons comment choisir la bonne architecture de réseau de neurones pour votre problème et comment bien gérer son apprentissage. Savoir résoudre des équations différentielles n’est plus nécessaire. Des problèmes difficiles comme la reconnaissance de l’écriture manuscrite peuvent maintenant être résolus avec quelques lignes de Python/Tensorflow et une collection de trucs & astuces d’ingénieur.",
    "speakers": [4],
    "complexity": "Confirmé",
    "tags": [
      "Méthodes et Outils"
    ]    
  },
  "105": {
    "id": 105,
    "title": "Fast Cars, Big Data - Ou comment le streaming peut aider la Formule 1!",
    "language": "Français",
    "description": "Les voitures, et tout particulièrement les voitures de courses, génèrent énormément de données. Durant cette présentation, basée sur des démonstrations, vous verrez comment : <ul><li>Capturer et traiter les données en temps réel avec l’API Kafka et Spark</li><li>Analyser ces données avec Apache Spark et Drill</li></ul>Le but de cette présentation, basée sur des démonstrations est de montrer qu’il est possible aujourd’hui, sur une seule plateforme big data: <ul><li>de capturer les données en temps reel sous forme de flux avec Kafka</li><li>les traiter avec Spark Streaming les stocker sous différentes formes en fonction des besoins fichiers (JSON, Parquet), mais aussi base nosql (HBase, MapRDB JSON, ..)</li><li>les analyser en mode batch par exemple pour faire de la maintenance predictive via du machine learning avec Spark ML, ou plus simplement des requetes SQL avec Apache Drill.</li>Le projet est disponible en open source et s’appuie sur: <ul><li>Des Producers/Consumers Apache Kafka</li><li>Une Web Application pour la visualisation en temps reel avec Kafka Consumer+Web Socket</li><li>Un simulateur de course pour la generation des données TORCS (The Open Source Racing Car Simulator)</li>",
    "speakers": [5],
    "complexity": "Débutant",
    "tags": [
      "Web"
    ]
  },
  "106": {
    "id": 106,
    "title": "20 cool things about Google Cloud Platform",
    "language": "Français",
    "description": "Depuis ses débuts il y’a plusieurs années, GCP aka Google Cloud Platform a considérablement évolué pour devenir une plaforme majeure de l’écosystème Cloud. Composée de nombreux produits et technologies, elle couvre aujourd’hui des choses très différentes comme les Machine Virtuelles, le PaaS, les bases de données relationnelles et NoSQL, le BigData, les Containers, le Machine Learning… Cette présentation donnera une vue d’ensemble de ces technologies et couvrira plus précisément 20 aspects particulièrement intéressants de GCP. Elle sera accompagnée de tips et de retours d’expérience en tant que dévelopeur et utilisateur de GCP depuis plusieurs années.",
    "speakers": [6],
    "complexity": "Débutant",
    "tags": [
      "Web"
    ]    
  },
  "107": {
    "id": 107,
    "title": "Sharing Code Between Web and Native Apps",
    "language": "English",
    "description": "NativeScript has opened up a whole new world to Angular developers: the ability to share code directly between your web and native iOS/Android applications. Which is awesome! But, just because you can share code across multiple platforms, doesn’t mean that you necessarily should.<br>In this talk we’ll first take a look at what NativeScript makes possible from a code sharing perspective. We’ll build a few Angular components and use them both in the browser and on mobile devices. Then we’ll take a step back and look at the same code from a pragmatic, maintenance-oriented perspective. Come for practical tips & tricks on sharing code across multiple development environments.",
    "speakers": [7],
    "complexity": "Débutant",
    "tags": [
      "Mobile"
    ]    
  },
  "108": {
    "id": 108,
    "title": "Wanna more fire? - Let's try polymerfire!",
    "language": "English",
    "description": "Have you ever tried to build Web application using Polymer with Firebase integration, additionally adhere to PWA's canons? I have, and know how many surprises can be found during developmet :). Polymerfire is a great Polymer Web Component Firebase and looks very easy to play with. During my talk I want to dive into tips & tricks on how you can integrate your web app on Polymer with Firebase + how to add offline support (since Firebase uses web sockets for data transferring, service worker will not help in that c",
    "speakers": [8],
    "complexity": "Débutant",
    "tags": [
      "Web"
    ]    
  },
  "109": {
    "id": 109,
    "title": "Don't call me just a website anymore. I am a progressive web app",
    "language": "Français",
    "description": "A la fin du XXième siècle, le web s’imposait sur nos ordinateurs face aux applications. Plus besoin d’installer de lourdes solutions depuis nos CD-Roms. Aujourd’hui, le mobile domine nos vies et les applications natives ont refait leur apparition.<br><br>Le web n’a pas dit son dernier mot et ne compte pas se laisser faire ! Les progressive web apps relèvent le défis afin d’apporter à vos utilisateurs la même expérience sur votre site qu’une application native.",
    "speakers": [9],
    "complexity": "Débutant",
    "tags": [
      "Web"
    ]    
  },
  "110": {
    "id": 110,
    "title": "Tips : Productivité et développement Android",
    "language": "Français",
    "description": "1 slide 1 tip ! Conférence interactive ou nous verrons ensemble des astuces pour améliorer sa productivité. Les sujets abordés seront vastes : Raccourcis, config et plugins Android Studio, méthodes \"utils\" parfois peu connus du SDK Android, tools externes. Vous savez concaténer une liste avec un délimiteur ? Supprimer les données de votre app et la relancer en 1s ? Non ?! Venez n'ayez pas peur ;)",
    "speakers": [10],
    "complexity": "Confirmé",
    "tags": [
      "Mobile"
    ]    
  },
  "111": {
    "id": 111,
    "title": "Develop a reactive Android app with Kotlin",
    "language": "Français",
    "description": "Kotlin est un langage développé par Jetbrains. Sa version 1.0 (production ready) est sortie en début d'année et a fait un certain buzz au sein de la communauté android. Cette session propose de découvrir ce langage, qui reprend certains aspects de groovy ou scala, et qui est très proche de swift dans la syntaxe et les concepts. Nous verrons comment Kotlin boost la productivité du développement d’applications Android et comment il permet de bien accompagner le développement réactif.",
    "speakers": [11],
    "complexity": "Débutant",
    "tags": [
      "Mobile"
    ]    
  },
  "112": {
    "id": 112,
    "title": "De Java à  Swift en deux temps trois mouvements",
    "language": "Français",
    "description": "Swift est désormais open source ! \"Google considérerait Swift comme un langage « de première classe » pour Android\" pouvait-on lire en avril sur le réseau. Et enfin un portage Android du langage a été \"merge\" dans la base de code officielle de Swift.<br><br>Bon tout ceci est un bon prétexte pour apprendre ce nouveau langage et les possibilités qu'il peut nous apporter en terme de développement. Une comparaison avec Java sera notamment proposée afin de montrer les similitudes et differences entre ces deux langages .",
    "speakers": [12],
    "complexity": "Débutant",
    "tags": [
      "Méthodes et Outils"
    ]    
  },
  "113": {
    "id": 113,
    "title": "WebVR : de la réalité virtuelle dans nos navigateurs, en route vers le Metaverse !",
    "language": "Français",
    "description": "WebVR est une future norme du W3C, en phase de draft actuellement.<br>Il s'agit d'une API Javascript expérimentale qui permet d’utiliser le navigateur web de votre ordinateur ou de votre mobile directement dans votre casque de réalité virtuelle, d’un basique Google Cardboard à un très sophistiqué HTC Vive.",
    "speakers": [13],
    "complexity": "Débutant",
    "tags": [
      "Web"
    ]    
  },
  "114": {
    "id": 114,
    "title": "Modules Angular 2 : des bundles au chargement dynamique",
    "language": "Français",
    "description": "Dernière modification majeure avant la version finale, les modules introduits dans la RC5 d'Angular 2 changent la donne dans la façon de structurer son application.<br><br>Qu'apportent-il en terme de simplification et d'encapsulation ? Comment s'intègrent-ils avec l'injection de dépendances hiérarchique ? <br><br>Le mythe des composants sur une étagère deviendra-t-il une réalité ?",
    "speakers": [14],
    "complexity": "Confirmé",
    "tags": [
      "Web"
    ]    
  },
  "115": {
    "id": 115,
    "title": "Clean Code",
    "language": "Français",
    "description": "« Une attention continue à l'excellence technique et à une bonne conception renforce l’Agilité » — 9e principe du manifeste agile.<br><br>À quoi ça sert de faire du code propre ? Et puis c'est quoi d'abord ? Et surtout, comment je m'y mets ? Par quoi je commence ?<br>Cette session cherche avant tout à questionner notre relation au code et à notre métier tout en apportant des éléments de réponse.",
    "speakers": [15],
    "complexity": "Débutant",
    "tags": [
      "Méthodes et Outils"
    ]    
  },
  "116": {
    "id": 116,
    "title": "My resumé in an operating system : un buzz et ses conséquences",
    "language": "Français",
    "description": "Just for fun !<br><br>Pour mon article mensuel sur mon blog, je me suis attelé à écrire un système d'exploitation basique pour expliquer les principes de base. <br><br>S'en est suivi un buzz non voulu :<ul><li>dans le top 5 de hacker news pendant plusieurs heures, top 10 pendant plus d'une journée</li><li>240 000 vues en 2 jours</li><li>quelques milliers de tweets</li><li>des articles sur des sites anglais, russes, allemands, turcs....</li><li>150 stars sur le projet GitHub</li><li>LinkedIn et viadeo qui s'excitent</li><li>quelques recruteurs en direct...</li></ul><br>Comment j'ai essayé de gérer ça dans la panique la plus totale....",
    "speakers": [16],
    "complexity": "Débutant",
    "tags": [
      "Web"
    ]    
  },
  "117": {
    "id": 117,
    "title": "Dans les coulisses de Google BigQuery",
    "language": "Français",
    "description": "Google BigQuery est la solution \"Analytics As a Service\" de Google.<br>Lorsque l’on pense à des technologies liées à la Big Data, on pense de suite à l’éco-système Hadoop, ou bien à Elasticsearch ou bien ces temps-ci beaucoup à Spark, mais il y a un « petit service » de Google qui ne fait pas beaucoup parler de lui mais qui peut tirer son épingle du jeu dans différents cas de figure.",
    "speakers": [17],
    "complexity": "Débutant",
    "tags": [
      "Méthodes et Outils"
    ]    
  },
  "118": {
    "id": 118,
    "title": "Les Acteurs, un modèle pour dompter le parrallélisme",
    "language": "Français",
    "description": "La programmation de machines multi-cœur tiens souvent de l'exercice de style, voire même pour certains de la magie noire. Le modèle de programmation basé sur les Acteurs, apparu dans les années 70, se prête bien à résoudre ce problème. Il a prouvé son efficacité grâce au langage Erlang/OTP et contribue au succès du framework Akka. Je vous propose de faire un tour d'horizon du concept, de ces principes fondamentaux, de ces forces mais aussi de ces faiblesses.",
    "speakers": [18],
    "complexity": "Confirmé",
    "tags": [
      "Méthodes et Outils"
    ]    
  },
  "119": {
    "id": 119,
    "title": "Client REST en Java: trop facile avec Feign !",
    "language": "Français",
    "description": "Depuis longtemps on cherche les meilleurs solutions pour écrire des serveurs RESTful en Java, et on se préoccupe moins du coté client REST. Or devant l'émergence des architectures micro-services on est de plus en plus concerné par l'écriture de cette couche client. Nous avons déjà beaucoup de possibilités en Java (Apache http-client et fluent-http), JAX-RS 2 (souvent avec Jersey), Spring RestTemplate, ... Mais aujourd'hui il y a l'excellente API qui vient de Netflix: Feign. Venez découvrir Feign durant une session avec beaucoup live coding qui introduira l'API et montrera la simplicité d'utilisation et l'extensibilité de l'api.",
    "speakers": [19],
    "complexity": "Débutant",
    "tags": [
      "Méthodes et Outils"
    ]    
  },
  "120": {
    "id": 120,
    "title": "Au secours, ma prod est sous Docker !",
    "language": "Français",
    "description": "Docker est un outil très puissant qui offre de nombreuses possibilités aux équipes.<br>Après l'avoir essayé en dev puis avoir convaincu les obs de le tester sur des environnements intermédiaires, il est temps de partir en prod, et là, c'est le drame ...<br><br>Le passage d'une production sous Docker engendre des problématiques comme le monitoring des containers, la gestion des logs, le scheduling ou la gestion des datas.<br>Dans cette présentation, je ferai un tour d'horizon des approches existantes pour résoudre ces problématiques ainsi que de solutions existantes.",
    "speakers": [20],
    "complexity": "Débutant",
    "tags": [
      "Méthodes et Outils"
    ]    
  },
  "121": {
    "id": 121,
    "title": "",
    "language": "Français",
    "description": "",
    "speakers": [21],
    "complexity": "Débutant",
    "tags": [
      "Méthodes et Outils"
    ]    
  }
}